{
  "architectures": [
    "FERNetForImageClassification"
  ],
  "id2label": {
    "0": "angry",
    "1": "disgust",
    "2": "fear",
    "3": "happy",
    "4": "neutral",
    "5": "sad",
    "6": "surprise"
  },
  "label2id": {
    "angry": 0,
    "disgust": 1,
    "fear": 2,
    "happy": 3,
    "neutral": 4,
    "sad": 5,
    "surprise": 6
  },
  "model_type": "cnn",
  "num_channels": 1
}